tsung/flow_3.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <!--<option name="global_ack_timeout" value="2000"></option> -->

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- Pick random user  -->
      <!-- WARNING: assumes you've seeded the db with at least 1000 users named User2, User3, ... -->
      <setdynvars sourcetype="random_number" start="2" end="10">
        <var name="random_user_number" />
      </setdynvars>

      <!-- Get home -->
      <request><http url="/login" method="GET" version="1.1" /></request>

      <!-- wait while guest looks at home page -->
      <!--<thinktime value="1" random="true"></thinktime> -->

      <!-- Sign in -->

      <request subst="true">
        <http
                url="/login"
                method="POST"
                version="1.1"
                contents="session[email]=User%%_random_user_number%%@example.com&amp;session[password]=foobar&amp;commit=Login"
                content_type="application/x-www-form-urlencoded"
        />
      </request>

      <request><http url="/items" method="GET" version="1.1" /></request>
      <request><http url="/items?utf8=&amp;category_search=1&amp;keyword_search=" method="GET" version="1.1" /></request>

      <setdynvars sourcetype="random_number" start="2" end="20">
        <var name="item_id" />
      </setdynvars>
      <setdynvars sourcetype="value" value="4">
        <var name="item_fixed" />
      </setdynvars>


      <transaction name="new_rental_post">
        <request subst="true">

          <http
                  url="/rent"
                  method="POST"
                  version="1.1"
                  contents="item_id=%%_item_id%%&amp;user_id=%%_random_user_number%%&amp;commit=Rent"
                  content_type="application/x-www-form-urlencoded"
          />
        </request>
      </transaction>

      <!-- follow redirect -->
      <request subst="true"><http url="%%_item_path%%" method="GET" version="1.1" /></request>

    </session>
  </sessions>
</tsung>