tsung/flow_3.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="podz-alex.42dz3asytu.us-west-2.elasticbeanstalk.com" port="80" type="tcp" />
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>

    <arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="4" unit="second" />
    </arrivalphase>

    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="8" unit="second" />
    </arrivalphase>

    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="16" unit="second" />
    </arrivalphase>

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <!--<option name="global_ack_timeout" value="2000"></option> -->

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- Pick random user  -->
      <setdynvars sourcetype="random_number" start="2" end="100">
        <var name="random_user_number" />
      </setdynvars>

      <!-- landing page -->
      <request>
        <http url='/' version='1.1' method='GET' />
      </request>

      <!-- login page -->
      <request>
        <http url='/login' version='1.1' method='GET' />
      </request>

      <!-- login post request -->
      <request subst="true">
        <http url='/login' version='1.1' method='POST'
              contents="session[email]=user%%_random_user_number%%@example.com&amp;
                          session[password]=foobar&amp;"
              content_type="application/x-www-form-urlencoded" />
      </request>

      <request><http url="/items" method="GET" version="1.1" /></request>
      <request>
        <http url="/items"
              method="GET"
              version="1.1"
              contents="category_search=1"
        />
      </request>

      <setdynvars sourcetype="random_number" start="1" end="8000">
        <var name="item_id" />
      </setdynvars>

      <transaction name="new_rental_post">
        <request subst="true">
          <http url="/items/%%_item_id%%"
                method="GET"
                version="1.1"
          />
        </request>
        <request subst="true">
          <http
                  url="/rent"
                  method="POST"
                  version="1.1"
                  contents="item_id=%%_item_id%%"
                  content_type="application/x-www-form-urlencoded"
          />
        </request>

        <!-- follow redirect -->
        <request subst="true">
          <http url="/items/%%_item_id%%"
                method="GET"
                version="1.1"
          />
        </request>
      </transaction>

    </session>
  </sessions>
</tsung>